In [57]:
import pandas as pd
import numpy as np

In [58]:
df=pd.read_csv(r"C:\Users\Darshan\Downloads\raw_students.csv")

In [59]:
df

   StudentID          Name     Age  Gender  Score                Email
0          1      John doe      20    male   85.0     john@example.com
1          2   Jane Smith       19  Female   90.0  janesmith@email.com
2          3   Bob Johnson     NaN    Male   78.0       bobj@email.com
3          4   Alice Brown      21  Female    NaN      alice@email.com
4          5     Chris Lee  twenty    Male   88.0          chris@email
5          6      John Doe      20    Male   85.0     john@example.com
6          7           NaN      22  Female   92.0      sarah@email.com
7          8  Michael King      23    Male   75.0    michael@email.com

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  8 non-null      int64
 1   Name       7 non-null      object
 2   Age        7 non-null      object
 3   Gender     8 non-null      object
 4   Score      7 non-null      float64
 5   Email      8 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 516.0+ bytes

In [61]:
df["Age"]=pd.to_numeric(df["Age"],errors="coerce")

In [62]:
df.dtypes

StudentID      int64
Name          object
Age          float64
Gender        object
Score        float64
Email         object
dtype: object

In [63]:
df.isnull().sum()

StudentID    0
Name         1
Age          2
Gender       0
Score        1
Email        0
dtype: int64

In [64]:
df["Age"]=df["Age"].fillna(df["Age"].mean())

In [65]:
df

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female    NaN      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7           NaN  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com

In [66]:
df["Score"]=df["Score"].fillna(df["Score"].median())

In [67]:
df

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female   85.0      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7           NaN  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com

In [68]:
df["Name"]=df["Name"].fillna("Unknown")

In [69]:
df

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female   85.0      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7       Unknown  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com

In [70]:
df["Gender"]=df["Gender"].str.capitalize()

In [71]:
df

   StudentID          Name        Age  Gender  Score                Email
0          1      John doe  20.000000    Male   85.0     john@example.com
1          2   Jane Smith   19.000000  Female   90.0  janesmith@email.com
2          3   Bob Johnson  20.833333    Male   78.0       bobj@email.com
3          4   Alice Brown  21.000000  Female   85.0      alice@email.com
4          5     Chris Lee  20.833333    Male   88.0          chris@email
5          6      John Doe  20.000000    Male   85.0     john@example.com
6          7       Unknown  22.000000  Female   92.0      sarah@email.com
7          8  Michael King  23.000000    Male   75.0    michael@email.com